{
  "Id": "AdventuresInWilderland",
  "Name": "Adventures in Wilderland",
  "Quests": [
    {
      "Id": "PassageThroughMirkwood",
      "Name": "Passage Through Mirkwood",
      "Description": "You are carrying a message from King Brand to Grimbeorn through Mirkwood Forest.\r",
      "Stages": [
        {
          "Id": "STAGE_ForestGate",
          "StageName": "Forest Gate",
          "StoryText": "The King of Dale has entrusted you with an urgent letter for Grimbeorn the Old, chieftain of the Beornings that dwell in the Anduin Vale. To reach his house you must journey through the shadowy forest of Mirkwood. Not long after entering the forest, you are surrounded by evil creatures.\r",
          "ObjectiveText": "Make your way through Mirkwood Forest.\r"
        },
        {
          "Id": "STAGE_EnchantedStream",
          "StageName": "Captured by Spiders",
          "StoryText": "Giant spiders have captured one of your companions. You watch in horror as your friend is bound in webbed cords to be dragged away and devoured. You cannot abandon your companion to such a fate.\r",
          "ObjectiveText": "Overcome \"Cocoon\" and rescue the captive Hero to allow travel.\r"
        },
        {
          "Id": "STAGE_MountainsOfMirkwood",
          "StageName": "Stand and Fight",
          "StoryText": "You have rescued your friend, but the creatures of Mirkwood continue to swarm around you. Realizing that you cannot outrun the beasts, you stand and fight!\r",
          "ObjectiveText": "Defeat each Enemy in play to allow travel."
        },
        {
          "Id": "STAGE_TheSpidersGlade",
          "StageName": "Turn and Flee",
          "StoryText": "You have rescued your friend, but the creatures of Mirkwood continue to swarm around you. Realizing you are in danger of being overwhelmed, you decide to make a run for it!\r",
          "ObjectiveText": "Overcome \"Find the Path\" to allow travel."
        },
        {
          "Id": "STAGE_OldForestRoad",
          "StageName": "The Enchanted Stream\r",
          "StoryText": "You hurry along the forest path only to find that a wide, dark river stops your progress. As you search for a place to ford, a giant creature emerges to block your way.\r",
          "ObjectiveText": "Defeat \"Ungoliant's Spawn\" to complete the Quest.\r"
        }
      ]
    },
    {
      "Id": "FliesAndSpiders",
      "Name": "Flies and Spiders",
      "Description": "You awaken to find that giant spiders have captured your friends.\r",
      "Stages": [
        {
          "Id": "DarkForest",
          "StageName": "Dark Forest",
          "StoryText": "You wake from a troubled sleep to find yourself alone in Mirkwood Forest. The last thing you remember is the sound of countless legs scuttling around your camp and hundreds of bulbous eyes peering from the dark. You realize that the giant spiders of Mirkwood have captured your friends in the night, and it’s up to you to find them!\r",
          "ObjectiveText": "Overcome \"Find Your Friends\" to unlock travel.\r"
        },
        {
          "Id": "TheSpidersLair",
          "StageName": "The Spiders' Lair",
          "StoryText": "You find your friends within a dark glade surrounded by giant spider webs. They have been bound and wrapped in cocoons of strong cords. They beg you to cut them free, but before you can the spiders descend from the trees to attack you.\r",
          "ObjectiveText": "Overcome \"Rescue Your Friends\" to unlock travel.\r"
        },
        {
          "Id": "TheSpidersWebs",
          "StageName": "The Spiders' Webs",
          "StoryText": "Your companions have been cut free, but the spiders are determined to recapture you. They spin giant webs from tree to tree, trapping you in their den. You will have to cut your way through them in order to escape.\r",
          "ObjectiveText": "Overcome \"Escape the Spiders\" to unlock travel.\r"
        },
        {
          "Id": "ForestGlade",
          "StageName": "Forest Glade",
          "StoryText": "You have cut your way through the spiders’ webs when an enormous queen spider appears and blocks your path. Her many offspring gather behind you. There is no turning back. You must defeat the giant spider.\r",
          "ObjectiveText": "Defeat \"Ungoliant's Spawn\" to complete the Quest.\r"
        }
      ]
    },
    {
      "Id": "LostInMirkwood",
      "Name": "Lost in Mirkwood",
      "Description": "After escaping giant spiders, you find yourself lost in the vastness of Mirkwood.",
      "Stages": [
        {
          "Id": "MirkwoodForest",
          "StageName": "Mirkwood Forest",
          "StoryText": "You have escaped from the spiders’ dark colony, only to find yourself lost in the vastness of Mirkwood. The forest is so dark and tangled that it is impossible to know which direction you should go. You must find some landmarks to get your bearings.\r",
          "ObjectiveText": "Overcome \"Follow the Stream\" to advance immediately to Forest Stream OR overcome \"Climb the Hill\" to advance immediately to Bare Hilltop.\r"
        },
        {
          "Id": "ForestStream",
          "StageName": "Forest Stream",
          "StoryText": "The twisted roots of ancient trees crowd the riverbank as the stream winds its way through the dense forest. Traveling this way is hard work. You wonder if you should continue or search for a better path.\r",
          "ObjectiveText": "Overcome \"Continue Downstream\" to advance immediately to Mirkwood Swamp OR overcome \"Search for a Path\" to advance immediately to Overgrown Trail.\r"
        },
        {
          "Id": "BareHilltop",
          "StageName": "Bare Hilltop",
          "StoryText": "From your view atop a low hill, you feel lost in a sea of green. Treetops are the only things visible for miles in any direction. As your eyes scan the horizon, you notice a light grey trail of smoke rising in the distance. Should you investigate the smoke? Or do you keep searching for a path out of the forest?\r",
          "ObjectiveText": "Overcome \"Investigate the Smoke\" to advance immediately to Abandoned Village OR overcome \"Search for a Path\" to advance immediately to Overgrown Trail.\r"
        },
        {
          "Id": "MirkwoodSwamp",
          "StageName": "Mirkwood Swamp",
          "StoryText": "At long last, the stream you have been following leads you to a wide bog. You must be near the Anduin River vale — but, to reach the mighty river, you must first cross the swamp. Who knows what dangers lie in wait?\r",
          "ObjectiveText": "Defeat \"Marsh Adder\" to complete the Quest.\r"
        },
        {
          "Id": "OvergrownTrail",
          "StageName": "Overgrown Trail",
          "StoryText": "After a long, desperate search you have found a path out of Mirkwood. The trail is overgrown and littered with animal tracks, but you believe it leads to the Anduin vale.",
          "ObjectiveText": "Overcome \"Escape the Forest\" to complete the Quest."
        },
        {
          "Id": "AbandonedVillage",
          "StageName": "Abandoned Village",
          "StoryText": "After navigating the forest toward the smoke, you find yourself near the eaves of Mirkwood. Before you lies the remains of an old Woodmen village. Instead of Woodmen, however, the village overrun is with Orcs! As they spot your weary group, it becomes clear that you must fight to reach the Anduin vale. \r",
          "ObjectiveText": "Defeat the last Enemy in play to complete the Quest.\r"
        }
      ]
    },
    {
      "Id": "JourneyDownTheAnduin",
      "Name": "Journey Down the Anduin",
      "Description": "You have found the mighty Anduin but you must still journey downriver to Grimbeorn.",
      "Stages": [
        {
          "Id": "WoodedRiverbank",
          "StageName": "To the River",
          "StoryText": "Emerging from Mirkwood Forest with an urgent message for Grimbeorn, you must make your way south along the Anduin River in order to reach the Carrock. As you approach the location of a small raft stashed on the riverbank, a fearsome Hill Troll emerges from behind a grouping of rocks, and attacks!\r",
          "ObjectiveText": "Defeat the Hill Troll.\r"
        },
        {
          "Id": "TheAnduinRiver",
          "StageName": "Anduin Passage",
          "StoryText": "Having defeated the Troll, you board a raft and float downriver. Yet your enemies pursue, harassing the small vessel as you attempt to navigate the river.\r",
          "ObjectiveText": "Make it down the river."
        },
        {
          "Id": "GrassyRiverbank",
          "StageName": "Ambush on the Shore",
          "StoryText": "Ongoing harassment from your enemies forces your raft to the shore. You must confront their ambush head on. If you survive this attack, the rest of your journey down the Anduin should be clear.\r",
          "ObjectiveText": "Defeat the last Enemy in play to complete the Quest.\r"
        }
      ]
    },
    {
      "Id": "ConflictAtTheCarrock",
      "Name": "Conflict at the Carrock",
      "Description": "You reach the Carrock only to discover that Grimbeorn has been captured by Trolls!\r",
      "Stages": [
        {
          "Id": "TheOldFord",
          "StageName": "Searching for Grimbeorn",
          "StoryText": "The Anduin river has carried you south from the Forest Gate to the land of the Beornings, where you hope to deliver King Brand’s message to their chieftain, Grimbeorn. However, when you pull your raft to shore, the Beornings tell you that Grimbeorn was last seen roaming as a great bear toward the Carrock. You continue south along the riverbank in order to find him.",
          "ObjectiveText": "Follow Grimbeorn’s trail."
        },
        {
          "Id": "TrollCamp",
          "StageName": "The Troll's Dinner",
          "StoryText": "After a day spent following Grimbeorn's trail, you make a startling discovery: a group of trolls has captured the great chieftain, and plans to eat him! You draw your weapons and rush to his rescue.",
          "ObjectiveText": "Rescue Grimbeorn."
        },
        {
          "Id": "TheCarrock",
          "StageName": "Fight with the Trolls",
          "StoryText": "Once freed from his chains, Grimbeorn joins you in your battle against his captors. “A barrel of beer to the one who brings me a troll’s head!” he roars while swinging a mighty blow at the nearest foe. But the trolls only laugh and say, \"Look, boys - more food! We're going to eat well tonight!\" ",
          "ObjectiveText": "Defeat the Trolls."
        }
      ]
    }
  ]
}